000_РОЗНИЦА_ЦЕНТР/src/Documents/ЭлектроннаяНакладная/ЭлектроннаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектроннаяНакладная</name>
  <basedOn>Document.ЗапросДоступностиТоваров</basedOn>
  <attributes>
    <name>ФамилияПолучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УлицаПолучатель</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Улицы</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УлицаОтправитель</name>
    <type>
      <types>CatalogRef.Улицы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонПолучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПосылокСлужбыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Реестр</name>
    <type>
      <types>DocumentRef.РеестрЭН</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонПолучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуТТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуСтикера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчествоПолучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправкаИзМагазина</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтделениеПолучатель</name>
    <type>
      <types>CatalogRef.Почтоматы</types>
      <types>String</types>
      <types>CatalogRef.Отделения</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтделениеОтправитель</name>
    <type>
      <types>CatalogRef.Отделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОператорДоставки</name>
    <type>
      <types>EnumRef.ОператорыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьПолучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефонаОтправитель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДомаОтправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НашаСуммаДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МагазинПолучатель</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентОтправитель</name>
    <type>
      <types>CatalogRef.КонтрагентыСлужбыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоОтправитель</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаСлужбыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КвартираПолучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПолучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаНаАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДомПолучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЭлектроннаяНакладная</types>
      <types>DocumentRef.ЗапросДоступностиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГородПолучатель</name>
    <type>
      <types>CatalogRef.ГородаДоставки</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГородОтправитель</name>
    <type>
      <types>CatalogRef.ГородаДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтправитель</name>
    <type>
      <types>CatalogRef.АдресаСлужбыДоставки</types>
    </type>
  </attributes>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/НастройкиСлужбДоставки/НастройкиСлужбДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиСлужбДоставки</name>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.КонтрагентыСлужбыДоставки</types>
    </type>
  </resources>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаСлужбыДоставки</types>
    </type>
  </resources>
  <resources>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Город</name>
    <type>
      <types>CatalogRef.ГородаДоставки</types>
    </type>
  </resources>
  <resources>
    <name>Улица</name>
    <type>
      <types>CatalogRef.Улицы</types>
    </type>
  </resources>
  <resources>
    <name>НомерДома</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Адрес</name>
    <type>
      <types>CatalogRef.АдресаСлужбыДоставки</types>
    </type>
  </resources>
  <resources>
    <name>Отделение</name>
    <type>
      <types>CatalogRef.Отделения</types>
    </type>
  </resources>
  <resources>
    <name>ОтправкаИзМагазина</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АдресFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПортFTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛогинFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПарольFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресДляПечатиPDF</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВызовМашины</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоНакладныхДляМашины</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Этаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОператорДоставки</name>
    <type>
      <types>EnumRef.ОператорыДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыЗапросовДоступностиТоваровШапка/СтатусыЗапросовДоступностиТоваровШапка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗапросовДоступностиТоваровШапка</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Удалён</name>
  </enumValues>
  <enumValues>
    <name>КОтправке</name>
  </enumValues>
  <enumValues>
    <name>Отменён</name>
  </enumValues>
  <enumValues>
    <name>Изменён</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Сборка</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаКассе</name>
  </enumValues>
  <enumValues>
    <name>ПродажаБезнал</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноСогласован</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитьОтмену</name>
  </enumValues>
  <enumValues>
    <name>Выдан</name>
  </enumValues>
  <enumValues>
    <name>ЧекВКЦ</name>
  </enumValues>
  <enumValues>
    <name>ВыданДоставке</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипДоставкиЗаказПокупателя/ТипДоставкиЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипДоставкиЗаказПокупателя</name>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>НоваяПочтаДоставкаВОтделение</name>
  </enumValues>
  <enumValues>
    <name>НоваяПочтаДоставкаПоАдресу</name>
  </enumValues>
  <enumValues>
    <name>MeestExpressДоставкаВОтделение</name>
  </enumValues>
  <enumValues>
    <name>MeestExpressДоставкаПоАдресу</name>
  </enumValues>
  <enumValues>
    <name>СлужбаДоставки</name>
  </enumValues>
  <enumValues>
    <name>Смешаный</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыПосылокСлужбыДоставки/СтатусыПосылокСлужбыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПосылокСлужбыДоставки</name>
  <enumValues>
    <name>Получена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>ВДороге</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ОператорыДоставки/ОператорыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОператорыДоставки</name>
  <enumValues>
    <name>ВнутренняяЛогистика</name>
  </enumValues>
  <enumValues>
    <name>НоваяПочта</name>
  </enumValues>
  <enumValues>
    <name>MeestExpress</name>
  </enumValues>
  <enumValues>
    <name>ДоставкаКурьером</name>
  </enumValues>
  <enumValues>
    <name>МеждународнаяДоставка</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Documents/РеестрЭН/РеестрЭН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеестрЭН</name>
  <posting>Deny</posting>
  <attributes>
    <name>Напечатан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МагазинСклад</name>
    <type>
      <types>CatalogRef.Магазины</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЭН</name>
    <attributes>
      <name>ЭлектронныеНакладные</name>
      <type>
        <types>DocumentRef.ЭлектроннаяНакладная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КонтактныеЛицаСлужбыДоставки/КонтактныеЛицаСлужбыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛицаСлужбыДоставки</name>
  <attributes>
    <name>Флаг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.КонтрагентыСлужбыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailДополнительный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Documents/ЭлектроннаяНакладная/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗапросДоступностиТоваров") Тогда

		Если (Не (ДанныеЗаполнения.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.КОтправке
			Или ДанныеЗаполнения.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ВыданДоставке))
			И Не ТехническаяПоддержкаВызовСервера.ИсключительныйРежим() Тогда
			
			ТекстОшибки = НСтр("ru='Отказано! «%1» не собран (или уже закрыт). Ввод на основании такого документа невозможен.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ДанныеЗаполнения);
			
			ВызватьИсключение ТекстОшибки;

		КонецЕсли;
		
		Если ДанныеЗаполнения.ТипДоставки = Перечисления.ТипДоставкиЗаказПокупателя.Самовывоз
				И ДанныеЗаполнения.Упаковки.Количество() = 0 Тогда
			
			ТекстОшибки = НСтр("ru='Отказано! «%1» не заполнены ВГХ. Ввод на основании такого документа невозможен.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ДанныеЗаполнения);
			
			ВызватьИсключение ТекстОшибки;

		КонецЕсли;
		
		Если ДанныеЗаполнения.МагазинОтправитель = ДанныеЗаполнения.МагазинПолучатель Тогда
			
			ТекстОшибки = НСтр("ru='Отказано! У «%1» магазины отправителя и получателя одинаковы. Ввод на основании такого документа невозможен.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ДанныеЗаполнения);

			ВызватьИсключение ТекстОшибки;
			
		КонецЕсли;
		
		ТТНСоздана = ОбменНПСервер.ТТНУжеСоздана(ДанныеЗаполнения);

		Если ТТНСоздана Тогда
			
			ТекстОшибки = НСтр("ru='Отказано! Для «%1» уже есть электронная накладная. Ввод на основании такого документа невозможен.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ДанныеЗаполнения);

			ВызватьИсключение ТекстОшибки;
			
		КонецЕсли;
		
		ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);

	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат
		
	КонецЕсли;

	СтатусПосылки = ОбменНПСервер.ПолучитьСтатусЭН(Ссылка);
	
	Если (СтатусПосылки.СтатусСлужбыДоставки = Перечисления.СтатусыПосылокСлужбыДоставки.Новая
				Или СтатусПосылки.СтатусСлужбыДоставки = Перечисления.СтатусыПосылокСлужбыДоставки.ПустаяСсылка())
			И Реестр.Пустая()
			И Не ПустаяСтрока(ВнешняяСсылка) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РеестрЭН.Ссылка,
			|	РеестрЭН.ВнешняяСсылка
			|ИЗ
			|	Документ.ЭлектроннаяНакладная КАК ЭлектроннаяНакладная
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросДоступностиТоваров КАК ЗапросДоступностиТоваров
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеестрЭН КАК РеестрЭН
			|			ПО РеестрЭН.МагазинСклад = ЗапросДоступностиТоваров.МагазинОтправитель
			|		ПО ЭлектроннаяНакладная.ДокументОснование = ЗапросДоступностиТоваров.Ссылка
			|ГДЕ
			|	НЕ РеестрЭН.Напечатан
			|	И ЭлектроннаяНакладная.Ссылка = &Ссылка";
			
		Запрос.УстановитьПараметр("Ссылка", Ссылка);

		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ОбменНПСервер.ДобавитьВРеестрЕН(Ссылка, ВнешняяСсылка, Выборка.ВнешняяСсылка);
			
		Иначе
			
			ОбменНПСервер.ДобавитьВРеестрЕН(Ссылка, ВнешняяСсылка);
			
		КонецЕсли;

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РеестрЭНСписокЭН.Ссылка
			|ИЗ
			|	Документ.РеестрЭН.СписокЭН КАК РеестрЭНСписокЭН
			|ГДЕ
			|	РеестрЭНСписокЭН.ЭлектронныеНакладные = &ЭлектронныеНакладные";
		
		Запрос.УстановитьПараметр("ЭлектронныеНакладные", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Реестр = Выборка.Ссылка;
			
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполнить документ.
// 
// Параметры:
//  ДокументДляЗаполнения - ДокументОбъект.ЭлектроннаяНакладная - Документ для заполнения
//  ДанныеЗаполнения - ДокументСсылка.ЗапросДоступностиТоваров -  Данные заполнения
Процедура ЗаполнитьДокумент(ДокументДляЗаполнения, ДанныеЗаполнения) Экспорт

	ОбщегоНазначенияРТ.ПроверитьВозможностьВводаНаОсновании(ДанныеЗаполнения);
	ДокументДляЗаполнения.Дата = ТекущаяДатаСеанса();
	ДокументДляЗаполнения.ДокументОснование = ДанныеЗаполнения;
	ДокументДляЗаполнения.ЗаказПокупателя = ДанныеЗаполнения.ДокументОснование;
	
	Если ДанныеЗаполнения.ОператорДоставки = Перечисления.ОператорыДоставки.ВнутренняяЛогистика Тогда
		ОператорДоставки = Перечисления.ОператорыДоставки.НоваяПочта;
	Иначе
		ОператорДоставки = ДанныеЗаполнения.ОператорДоставки;
	КонецЕсли;
	
	Если Не ДанныеЗаполнения.СуммаОплатыДоставки = 0 Тогда
		ДокументДляЗаполнения.НашаСуммаДоставки = ДанныеЗаполнения.СуммаОплатыДоставки;
	КонецЕсли;
	
	ДокументДляЗаполнения.КомментарийДляДоставки = ДанныеЗаполнения.ДокументОснование.КомментарийДляДоставки;
	
	//Данные получателя
	Если ДанныеЗаполнения.ОператорДоставки = Перечисления.ОператорыДоставки.ВнутренняяЛогистика Тогда
		
		ДокументДляЗаполнения.МагазинПолучатель = ДанныеЗаполнения.МагазинПолучатель;
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	НастройкиСлужбДоставки.Контрагент,
			|	НастройкиСлужбДоставки.КонтактноеЛицо,
			|	НастройкиСлужбДоставки.НомерТелефона,
			|	НастройкиСлужбДоставки.Отделение,
			|	НастройкиСлужбДоставки.ОтправкаИзМагазина,
			|	КонтактныеЛицаСлужбыДоставки.КонтактноеЛицо,
			|	КонтактныеЛицаСлужбыДоставки.Телефон,
			|	КонтактныеЛицаСлужбыДоставки.Email,
			|	КонтактныеЛицаСлужбыДоставки.Контрагент,
			|	КонтактныеЛицаСлужбыДоставки.Фамилия,
			|	КонтактныеЛицаСлужбыДоставки.Имя,
			|	КонтактныеЛицаСлужбыДоставки.Отчество,
			|	КонтактныеЛицаСлужбыДоставки.Действие,
			|	КонтактныеЛицаСлужбыДоставки.Предопределенный,
			|	КонтактныеЛицаСлужбыДоставки.ИмяПредопределенныхДанных,
			|	КонтактныеЛицаСлужбыДоставки.Представление,
			|	АдресаСлужбыДоставки.ИДГорода,
			|	АдресаСлужбыДоставки.ИДУлицы,
			|	АдресаСлужбыДоставки.Дом,
			|	АдресаСлужбыДоставки.Адрес
			|ИЗ
			|	РегистрСведений.НастройкиСлужбДоставки КАК НастройкиСлужбДоставки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаСлужбыДоставки КАК КонтактныеЛицаСлужбыДоставки
			|		ПО НастройкиСлужбДоставки.КонтактноеЛицо = КонтактныеЛицаСлужбыДоставки.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаСлужбыДоставки КАК АдресаСлужбыДоставки
			|		ПО НастройкиСлужбДоставки.Адрес = АдресаСлужбыДоставки.Ссылка
			|ГДЕ
			|	НастройкиСлужбДоставки.Магазин = &Магазин
			|	И НастройкиСлужбДоставки.ОператорДоставки = &ОператорДоставки";
		
		Запрос.УстановитьПараметр("Магазин", ДанныеЗаполнения.МагазинПолучатель);
		Запрос.УстановитьПараметр("ОператорДоставки", ОператорДоставки);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДокументДляЗаполнения.ДоставкаНаАдрес = Истина;
			ДокументДляЗаполнения.ГородПолучатель = Выборка.ИДГорода;
			ДокументДляЗаполнения.ОтделениеПолучатель = Выборка.Отделение;
			ДокументДляЗаполнения.УлицаПолучатель = Выборка.ИДУлицы;
			ДокументДляЗаполнения.ФамилияПолучатель = Выборка.Фамилия;
			ДокументДляЗаполнения.ИмяПолучатель = Выборка.Имя;
			ДокументДляЗаполнения.ОтчествоПолучатель = Выборка.Отчество;
			ДокументДляЗаполнения.ТелефонПолучатель = Выборка.Телефон;
			ДокументДляЗаполнения.ДомПолучатель = Выборка.Дом;
		
		КонецЦикла;
			
	Иначе
			
		ДокументДляЗаполнения.МагазинПолучатель = Справочники.Магазины.ПустаяСсылка();
		ДокументДляЗаполнения.ГородПолучатель = ДанныеЗаполнения.ДокументОснование.Город;
		ДокументДляЗаполнения.ОтделениеПолучатель = ДанныеЗаполнения.ДокументОснование.Отделение;
		ДокументДляЗаполнения.УлицаПолучатель = ДанныеЗаполнения.ДокументОснование.Улица;
		ДокументДляЗаполнения.ДомПолучатель = ДанныеЗаполнения.ДокументОснование.Дом;
		ДокументДляЗаполнения.КвартираПолучатель = ДанныеЗаполнения.ДокументОснование.Квартира;
		ДокументДляЗаполнения.ФамилияПолучатель = ДанныеЗаполнения.ДокументОснование.Фамилия;
		ДокументДляЗаполнения.ИмяПолучатель = ДанныеЗаполнения.ДокументОснование.Имя;
		ДокументДляЗаполнения.ОтчествоПолучатель = ДанныеЗаполнения.ДокументОснование.Отчество;
		ДокументДляЗаполнения.ТелефонПолучатель = ДанныеЗаполнения.ДокументОснование.Телефон;
		ДокументДляЗаполнения.РайонПолучатель = ДанныеЗаполнения.ДокументОснование.Район;
		ДокументДляЗаполнения.ОбластьПолучатель = ДанныеЗаполнения.ДокументОснование.Область;
		ДокументДляЗаполнения.ДоставкаНаАдрес = ДанныеЗаполнения.ДокументОснование.ДоставкаНаАдрес;

	КонецЕсли;	

	//Данные отправителя
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиСлужбДоставки.Контрагент,
		|	НастройкиСлужбДоставки.КонтактноеЛицо,
		|	НастройкиСлужбДоставки.НомерТелефона,
		|	НастройкиСлужбДоставки.Отделение,
		|	НастройкиСлужбДоставки.ОтправкаИзМагазина,
		|	АдресаСлужбыДоставки.ИДГорода,
		|	АдресаСлужбыДоставки.ИДУлицы,
		|	АдресаСлужбыДоставки.Дом,
		|	АдресаСлужбыДоставки.Ссылка
		|ИЗ
		|	РегистрСведений.НастройкиСлужбДоставки КАК НастройкиСлужбДоставки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаСлужбыДоставки КАК АдресаСлужбыДоставки
		|		ПО НастройкиСлужбДоставки.Адрес = АдресаСлужбыДоставки.Ссылка
		|ГДЕ
		|	НастройкиСлужбДоставки.Магазин = &Магазин
		|	И НастройкиСлужбДоставки.ОператорДоставки = &ОператорДоставки";
	
	Если ТипЗнч(ДанныеЗаполнения.МагазинОтправитель) = Тип("СправочникСсылка.Склады") Тогда
		Запрос.УстановитьПараметр("Магазин", ДанныеЗаполнения.МагазинОтправитель.Магазин);
	Иначе
		Запрос.УстановитьПараметр("Магазин", ДанныеЗаполнения.МагазинОтправитель);
	КонецЕсли;

	Запрос.УстановитьПараметр("ОператорДоставки", ОператорДоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументДляЗаполнения.КонтрагентОтправитель = Выборка.Контрагент;
		ДокументДляЗаполнения.ОтправкаИзМагазина = Выборка.ОтправкаИзМагазина;
		ДокументДляЗаполнения.КонтактноеЛицоОтправитель = Выборка.КонтактноеЛицо;
		ДокументДляЗаполнения.НомерТелефонаОтправитель = Выборка.НомерТелефона;
		ДокументДляЗаполнения.ГородОтправитель = Выборка.ИДГорода;
		ДокументДляЗаполнения.УлицаОтправитель = Выборка.ИДУлицы;
		ДокументДляЗаполнения.НомерДомаОтправитель = Выборка.Дом;
		ДокументДляЗаполнения.АдресОтправитель = Выборка.Ссылка;
		ДокументДляЗаполнения.ОтделениеОтправитель = Выборка.Отделение;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Иначе
	
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	
#КонецЕсли
